이벤트 page가 많이 몰릴 것으로 예상하여 nginx에 캐싱을 처리 할 수 있다.

혹시나 쿠키를 사용한다면 캐싱될 컨턴츠에서 쿠키도 캐싱될지, 그 쿠키가 사용자에게 아이덴티티를 부여하는 내용이 있는지 확인해야 한다.

NginX를 이용한 Static 컨텐츠 서비스를 요약하였다.

* NginX를 리버스 프록시 서버로 사용하는 이유
  1. 로드밸런싱  
  -> 유저의 요청을 웹 App 서버 (WAS)로 분산 할 수 있다.
  
  2. 유저 요청에 대한 선처리  
  -> 유저의 요청이 WAS에 도달하기 전에 다양한 처리를 할 수 있다. 웹 App 방화벽(WAF)를 설치하거나, 유저의 요청을 다른 위치로 보낼 수 있다.
   
  3. 캐싱  
  -> 웹 서비스는 이미지 Css, JS 같은 정적 Page를 가지고 있는데. 이런 정적 컨텐츠를 NginX에서 대신 처리하여 응답 속도를 높인다. 
  WAS에 대한 부담을 줄일 수 있으며, 컨텐츠들을 메모리에 캐시할 경우 고성능 웹 서비스 만들 수도 있다. 
  
* 웹 컨텐츠 캐시
  * 서버 캐시  
  유저의 요청을 받아 DB까지 조회하여 HTML page를 만들고 이미지, CSS, JS등 다양한 오브젝트들을 함께 응답해야 하는데 웹 서버가 하는일이 늘면서 
  리버스 프록시를 이용 두 개 이상 WAS(Web Application Server)에서 요청을 분산해서 처리하도록 구성 
   
유저의 요청이 WAS까지 가지 않고, 리버스 프락시 서버를 한번 거치고, 요청을 분산하기 위해 프락시 서버를 한번 더 거쳐야 하는 도중 